Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Please refer to the current edition of the "Internet Official Protocol Standards" (STD 1) for the standardization state and status of this protocol.
zh_cn: 有关本协议的标准化状态和状态，请参阅当前版本的“互联网官方协议标准”(STD 1)。

source: Port Number
zh_cn: 端口号

source: Practical Considerations
zh_cn: 实际考虑因素

source: Practical information systems require more functionality than simple retrieval, including search, front-end update, and annotation.
zh_cn: 实用信息系统需要比简单检索更多的函数，包括搜索，前端更新和注释。

source: Practically, parallelism in RxJava means running independent flows and merging their results back into a single flow.
zh_cn: 实际上，RxJava 中的并行性意味着运行独立流并将其结果合并回单个流。

source: Practically, the 1.x `fromEmitter` (formerly `fromAsync`) has been renamed to `Flowable.create`.
zh_cn: 实际上，1.x 的 `fromEmitter`(以前称为 fromAsync`)已被重命名为 `Flowable.create`。

source: Practically, this is when the body of the given example above executes.
zh_cn: 实际上，这是在上面给出的示例的主体执行时。

source: Precedence and Security
zh_cn: 优先级和安全性

source: Presentation Language
zh_cn: 表示语言

source: Previous revisions of HTTP gave a specific number of connections as a ceiling, but this was found to be impractical for many applications.
zh_cn: HTTP 的先前版本提供了特定数量的连接作为上限，但发现这对许多应用程序来说是不切实际的。

source: Previous versions of TLS would use other values in this field under some circumstances.
zh_cn: 在某些情况下，以前版本的 TLS 将在此字段中使用其他值。

source: Prior to persistent connections, a separate TCP connection was established to fetch each URL, increasing the load on HTTP servers and causing congestion on the Internet.
zh_cn: 在持久连接之前，建立了单独的 TCP 连接以获取每个 URL，从而增加了 HTTP 服务器上的负载并导致互联网上的拥塞。

source: Privacy Issues Connected to Accept Headers
zh_cn: 连接到 Accept 首部的隐私问题

source: Privacy of Server Log Information
zh_cn: 服务器日志信息的隐私

source: Proactive Negotiation
zh_cn: 主动协商

source: Processing Representation Data
zh_cn: 处理表示数据

source: Processing the numbers 1 to 10 in parallel is a bit more involved:
zh_cn: 并行处理数字 1 到 10 涉及更多：

source: Product Tokens
zh_cn: 产品标记

source: Product tokens SHOULD be short and to the point.
zh_cn: 产品标记应该简短而切题。

source: Product tokens are used to allow communicating applications to identify themselves by software name and version.
zh_cn: 产品标记用于允许通信应用程序通过软件名称和版本来标识自己。

source: Proper use of "reset" segments can disambiguate these cases.
zh_cn: 正确使用“重置”报文段可以消除这些情况的歧义。

source: Protection against replay for ordinary TLS 1.3 1-RTT data is provided via the server's Random value, but 0-RTT data does not depend on the ServerHello and therefore has weaker guarantees.
zh_cn: 通过服务器的 Random 值提供普通 TLS 1.3 1-RTT 数据的重放保护，但 0-RTT 数据不依赖于 ServerHello，因此保证较弱。

source: Protocol Overview
zh_cn: 协议概述

source: Protocol Parameters
zh_cn: 协议参数

source: Protocol Versioning
zh_cn: 协议版本控制

source: Protocol messages MUST be sent in the order defined in Section 4.4.1 and shown in the diagrams in Section 2.
zh_cn: 协议消息必须按照第 4.4.1 节中定义的顺序发送，并在第 2 节的图中显示。

source: Proxies and Caching
zh_cn: 代理和缓存

source: Proxies are often used to group an organization's HTTP requests through a common intermediary for the sake of security, annotation services, or shared caching.
zh_cn: 代理通常用于通过公共中介对组织的 HTTP 请求进行分组，以实现安全性、注释服务或共享缓存。

source: Proxies that support CONNECT SHOULD restrict its use to a limited set of known ports or a configurable whitelist of safe request targets.
zh_cn: 支持 CONNECT 的代理应该将其使用限制在一组有限的已知端口或安全请求目标的可配置白名单中。

source: Proxy Servers
zh_cn: 代理服务器

source: Proxy and gateway applications need to be careful when forwarding messages in protocol versions different from that of the application.
zh_cn: 在转发与应用程序不同的协议版本的消息时，代理和网关应用程序需要小心。

source: Proxy authentication might be used to establish the authority to create a tunnel.
zh_cn: 代理身份验证可用于建立创建隧道的权限。

source: Proxy configuration is implementation-dependent, but is often based on URI prefix matching, selective authority matching, or both, and the proxy itself is usually identified by an "http" or "https" URI.
zh_cn: 代理配置依赖于实现，但通常基于 URI 前缀匹配，选择性权限匹配或两者，并且代理本身通常由“http”或“https”URI 标识。

source: Proxy servers might make this a higher value since it is likely that the client will be making more connections through the same proxy server.
zh_cn: 代理服务器可能会使此值更高，因为客户端可能会通过同一代理服务器建立更多连接。

source: Proxy servers might make this a higher value since it is likely that the client will be making more connections through the same server.
zh_cn: 代理服务器可能会使此值更高，因为客户端可能会通过同一服务器建立更多连接。

source: Purpose
zh_cn: 目的

source: Quotation marks surround literal text.
zh_cn: 引号围绕文字文本。

source: RCV.NXT - receive next
zh_cn: RCV.NXT - 接收下一个

source: RCV.NXT = next sequence number expected on an incoming segments, and is the left or lower edge of the receive window
zh_cn: RCV.NXT =传入报文段上预期的下一个序列号，是接收窗口的左下边缘

source: RCV.NXT+RCV.WND-1 = last sequence number expected on an incoming segment, and is the right or upper edge of the receive window
zh_cn: RCV.NXT+RCV.WND-1 =传入报文段上预期的最后序列号，是接收窗口的右边缘或上边缘

source: RCV.UP - receive urgent pointer
zh_cn: RCV.UP - 接收紧急指针

source: RCV.WND - receive window
zh_cn: RCV.WND - 接收窗口

source: RECEIVEs are allowed in this state.
zh_cn: 在这种状态下允许 RECEIVE。

source: REFERENCES
zh_cn: 参考文献

source: RFC 2616 permits an HTTP client to close the connection at any time, and requires servers to recover gracefully.
zh_cn: RFC 2616 允许 HTTP 客户端随时关闭连接，并要求服务器正常恢复。

source: RSA encryption is done using the RSAES-PKCS1-v1_5 encryption scheme defined in [PKCS1].
zh_cn: 使用 [PKCS1] 中定义的 RSAES-PKCS1-v1_5 加密方案完成 RSA 加密。

source: RSA keys MAY be used with any permitted hash algorithm, subject to restrictions in the certificate, if any.
zh_cn: RSA 密钥可以与任何允许的哈希算法一起使用，受限于证书中的限制(如果有的话)。

source: RSA signatures MUST use an RSASSA-PSS algorithm, regardless of whether RSASSA-PKCS1-v1_5 algorithms appear in "signature_algorithms".
zh_cn: 无论 RSASSA-PKCS1-v1_5 算法是否出现在“signature_algorithms”中，RSA 签名都必须使用 RSASSA-PSS 算法。

source: RSASSA-PKCS1-v1_5 algorithms: Indicates a signature algorithm using RSASSA-PKCS1-v1_5 [RFC8017] with the corresponding hash algorithm as defined in [SHS].
zh_cn: RSASSA-PKCS1-v1_5 算法：表示使用 RSASSA-PKCS1-v1_5 [RFC8017] 的签名算法，其具有 [SHS] 中定义的相应散列算法。

source: RSASSA-PSS PSS algorithms: Indicates a signature algorithm using RSASSA-PSS [RFC8017] with mask generation function 1.
zh_cn: RSASSA-PSS PSS 算法：使用使用掩码生成功能 1 的 RSASSA-PSS [RFC8017] 表示签名算法。

source: RSASSA-PSS RSAE algorithms: Indicates a signature algorithm using RSASSA-PSS [RFC8017] with mask generation function 1.
zh_cn: RSASSA-PSS RSAE 算法：表示使用带掩码生成功能 1 的 RSASSA-PSS [RFC8017] 的签名算法。

source: RST: Reset the connection
zh_cn: RST：重置连接

source: Range Units
zh_cn: 范围单位

source: Reactive Negotiation
zh_cn: 响应性协商

source: Reactive Programming
zh_cn: 响应式编程

source: ReactiveX Is a Polyglot Implementation
zh_cn: ReactiveX 是一种多语言实现

source: ReactiveX Observables support not just the emission of single scalar values (as Futures do), but also of sequences of values or even infinite streams.
zh_cn: ReactiveX Observables 不仅支持单个标量值的发射(如 Futures 那样)，还支持值序列甚至无限流。

source: ReactiveX Observables, on the other hand, are intended for composing flows and sequences of asynchronous data.
zh_cn: 另一方面，ReactiveX Observables 旨在 用于 组合异步数据流和序列。

source: ReactiveX is a library for composing asynchronous and event-based programs by using observable sequences.
zh_cn: ReactiveX 是一个库，通过使用可观察序列来编写异步和基于事件的程序。

source: ReactiveX is currently implemented in a variety of languages, in ways that respect those languages’ idioms, and more languages are being added at a rapid clip.
zh_cn: ReactiveX 在大量的编程语言中都有实现，并尊重实现语言的风格，而且更多的实现正在飞速增加。

source: ReactiveX is not biased toward some particular source of concurrency or asynchronicity.
zh_cn: ReactiveX 不偏向某些特定的并发或异步性源。

source: ReactiveX may be functional, and it may be reactive, but “functional reactive programming” is a different animal.
zh_cn: ReactiveX 可能是函数式的，它可能是响应式的，但“函数响应式编程”是一种不同的动物。

source: ReactiveX provides a collection of operators with which you can filter, select, transform, combine, and compose Observables.
zh_cn: ReactiveX 提供了 一系列操作符，你可以使用它们来过滤(filter)，选择(select)，转换(transform)，结合(combine)和组合(compose) Observable。

source: Readers familiar with regular expressions should see Appendix B for an example of a non-validating URI-reference parser that will take any given string and extract the URI components.
zh_cn: 熟悉正则表达式的读者应该参阅附录 B，了解一个非验证 URI 引用解析器的示例，它将获取任何给定的字符串并提取 URI 组件。

source: Receive Sequence Space
zh_cn: 接收序列空间

source: Receive Sequence Variables
zh_cn: 接收序列变量

source: Received data is decrypted, verified, decompressed, reassembled, and then delivered to higher-level clients.
zh_cn: 接收的数据经过解密，验证，解压缩，重新组装，然后传送给更高级别的客户端。

source: Received data is verified, decrypted, reassembled, and then delivered to higher-level clients.
zh_cn: 接收的数据经过验证，解密，重新组装，然后交付给更高级别的客户。

source: Receiving a Certificate Message
zh_cn: 接收 Certificate 消息

source: Reception of a handshake_failure alert message indicates that the sender was unable to negotiate an acceptable set of security parameters given the options available.
zh_cn: 接收 handshake_failure 警报消息表示发送方无法在给定可用选项的情况下协商一组可接受的安全参数。

source: Reception of this message causes the receiver to instruct the record layer to immediately copy the read pending state into the read current state.
zh_cn: 接收此消息会导致接收器指示记录层立即将读取挂起状态复制到读取当前状态。

source: Recipients MUST receive and process interleaved application layer traffic during handshakes subsequent to the first one on a connection.
zh_cn: 接收者必须在连接上的第一个握手期间接收和处理交错的应用层流量。

source: Recipients of Finished messages MUST verify that the contents are correct and if incorrect MUST terminate the connection with a "decrypt_error" alert.
zh_cn: Finished 消息的接收者必须验证内容是否正确，如果不正确，必须使用“decrypt_error”警报终止连接。

source: Recipients of Finished messages MUST verify that the contents are correct.
zh_cn: Finished 消息的接收者必须验证内容是正确的。

source: Recipients of an HTTP/1.0 request that lacks a Host header field MAY attempt to use heuristics (e.g., examination of the URI path for something unique to a particular host) in order to determine what exact resource is being requested.
zh_cn: 缺少 Host 首部字段的 HTTP/1.0 请求的接收者可以尝试使用启发法(例如，检查 URI 路径以查找特定主机特有的内容)，以便确定正在请求什么样的确切资源。

source: Recipients of an HTTP/1.0 request that lacks a Host header field might need to use heuristics (e.g., examination of the URI path for something unique to a particular host) in order to guess the effective request URI's authority component.
zh_cn: 缺少主机首部字段的 HTTP/1.0 请求的接收者可能需要使用启发式方法(例如，检查特定主机特有的 URI 路径)以便猜测有效请求 URI 的权限组件。

source: Recipients of an invalid request-line SHOULD respond with either a 400 (Bad Request) error or a 301 (Moved Permanently) redirect with the request-target properly encoded.
zh_cn: 无效请求行的接收者应该响应 400(错误请求)错误或 301(移动永久)重定向，并且请求目标正确编码。

source: Recipients that process the value of a quoted-string MUST handle a quoted-pair as if it were replaced by the octet following the backslash.
zh_cn: 处理带引号的字符串的值的接收者必须处理一个引用对，就好像它被反斜杠后面的八位字节替换一样。

source: Recipients typically parse the request-line into its component parts by splitting on whitespace (see Section 3.5), since no whitespace is allowed in the three components.
zh_cn: 接收者通常通过拆分空格来将请求行解析为其组成部分(参见第 3.5 节)，因为这三个组件中不允许有空格。

source: Record Compression and Decompression
zh_cn: 记录压缩和解压缩

source: Record Layer
zh_cn: 记录层

source: Record Payload Protection
zh_cn: 记录有效载荷保护

source: Record Protocol
zh_cn: 记录协议

source: Recovery from Old Duplicate SYN
zh_cn: 从旧的重复 SYN 恢复

source: Recursive Schedulers
zh_cn: 递归调度器

source: Reference Resolution
zh_cn: 引用解析

source: References
zh_cn: 参考

source: Regardless, only the origin server needs to know how each of its resource identifiers corresponds to an implementation and how each implementation manages to select and send a current representation of the target resource in a response to GET.
zh_cn: 无论如何，只有源服务器需要知道其每个资源标识符如何对应于实现以及每个实现如何在对 GET 的响应中设置选择和发送目标资源的当前表示。

source: Registration of Transfer Codings now requires IETF Review (Section 8.4)
zh_cn: 转让密码的注册现在要求 IETF 审查(第 8.4 节)

source: Relation to Other Protocols
zh_cn: 与其他协议的关系

source: Relative Reference
zh_cn: 相对引用

source: Relative efficiency: Cryptographic operations tend to be highly CPU intensive, particularly public key operations.
zh_cn: 相对效率：加密操作往往是高度 CPU 密集型的，尤其是公钥操作。

source: Reliable Communication
zh_cn: 可靠的通信

source: Remark
zh_cn: 备注

source: Remember that each segment is bound to as many consecutive sequence numbers as there are octets of data in the segment.
zh_cn: 请记住，每个报文段都绑定了与报文段中数据的八位字节一样多的连续序列号。

source: Removed as the Reactive Streams specification mandates the `onXXX` methods don't crash and therefore the default is to not have a safety net in `subscribe`.
zh_cn: 在 Reactive Streams 规范要求删除 `onXXX` 方法不会崩溃，因此默认是在 `subscribe` 中没有安全网。

source: Removed in version
zh_cn: 在版本移除

source: Representation Data
zh_cn: 表示数据

source: Representation Metadata
zh_cn: 表示元数据

source: Representation header fields provide metadata about the representation.
zh_cn: 表示首部字段提供有关表示的元数据。

source: Representations
zh_cn: 表示

source: Request
zh_cn: 请求

source: Request (section 5) and Response (section 6) messages use the generic message format of RFC 822 [9] for transferring entities (the payload of the message).
zh_cn: 请求(第 5 节)和响应(第 6 节)消息使用 RFC 822 [9] 的通用消息格式来传输实体(消息的有效载荷)。

source: Request Context
zh_cn: 请求上下文

source: Request Header Fields
zh_cn: 请求首部字段

source: Request Line
zh_cn: 请求行

source: Request Methods
zh_cn: 请求方法

source: Request Smuggling
zh_cn: 请求走私

source: Request Target
zh_cn: 请求目标

source: Request and Response messages MAY transfer an entity if not otherwise restricted by the request method or response status code.
zh_cn: 请求和响应消息如果没有请求方法或响应状态代码的限制，可以传输实体。

source: Request message framing is independent of method semantics, even if the method does not define any use for a message body.
zh_cn: 请求消息帧独立于方法语义，即使该方法没有为消息主体定义任何用途。

source: Request methods are considered "safe" if their defined semantics are essentially read-only; i.e., the client does not request, and does not expect, any state change on the origin server as a result of applying a safe method to a target resource.
zh_cn: 如果请求方法的定义语义基本上是只读的，则被认为是“安全的”;即，作为对目标资源应用安全方法的结果，客户端不请求并且不期望源服务器上的任何状态改变。

source: Request methods can be defined as "cacheable" to indicate that responses to them are allowed to be stored for future reuse; for specific requirements see [RFC7234].
zh_cn: 请求方法可以定义为“可缓存”，以指示允许存储对它们的响应以供将来重用；有关具体要求，请参阅 [RFC7234]。

source: Request-Line
zh_cn: 请求行

source: Request-URI
zh_cn: 请求 URI

source: Request-header field names can be extended reliably only in combination with a change in the protocol version.
zh_cn: 请求首部字段名称只能与协议版本的更改一起可靠地扩展。

source: Requests are serviced internally or by passing them on, with possible translation, to other servers.
zh_cn: 请求在内部提供服务，或者通过可能的转换将其传递给其他服务器。

source: Requirements
zh_cn: 要求

source: Requirements Language
zh_cn: 要求语言

source: Requirements Notation
zh_cn: 需求符号

source: Requirements Terminology
zh_cn: 要求术语

source: Requirements for HTTP/1.1 clients:
zh_cn: HTTP/1.1 客户端的要求：

source: Requirements for HTTP/1.1 origin servers:
zh_cn: HTTP/1.1 源服务器的要求：

source: Requirements for HTTP/1.1 proxies:
zh_cn: HTTP/1.1 代理的要求：

source: Requirements on such "forwarding" of messages are defined in Section 5.7.
zh_cn: 第 5.7 节中定义了对这种“转发”消息的要求。

source: Reserved Characters
zh_cn: 保留字符

source: Reserved for future use.
zh_cn: 保留供将来使用。

source: Reset Generation
zh_cn: 重置生成

source: Reset Processing
zh_cn: 重置处理

source: Resources
zh_cn: 资源

source: Resources made available via the "https" scheme have no shared identity with the "http" scheme even if their resource identifiers indicate the same authority (the same host listening to the same TCP port).
zh_cn: 通过“https”方案提供的资源与“http”方案没有共享标识，即使它们的资源标识符指示相同的权限(同一主机侦听相同的 TCP 端口)。

source: Resources may be available in multiple representations (e.g. multiple languages, data formats, size, and resolutions) or vary in other ways.
zh_cn: 资源可以以多种表示形式(例如，多种语言，数据格式，大小和分辨率)获得，或者以其他方式变化。

source: Response
zh_cn: 响应

source: Response Cacheability
zh_cn: 响应可缓存性

source: Response Context
zh_cn: 响应背景

source: Response Header Fields
zh_cn: 响应首部字段

source: Response Splitting
zh_cn: 响应分解

source: Response Status Codes
zh_cn: 响应状态代码

source: Response messages with an error status code usually contain a payload that represents the error condition, such that it describes the error state and what next steps are suggested for resolving it.
zh_cn: 具有错误状态代码的响应消息通常包含表示错误条件的有效载荷，以便它描述错误状态以及建议用于解决它的后续步骤。

source: Response-header field names can be extended reliably only in combination with a change in the protocol version.
zh_cn: 只有在协议版本发生变化的情况下，才能可靠地扩展响应首部字段名称。

source: Responses to POST requests are only cacheable when they include explicit freshness information (see Section 4.2.1 of [RFC7234]).
zh_cn: POST 请求的响应只有在包含显式新鲜度信息时才可缓存(参见 [RFC7234] 的第 4.2.1 节)。

source: Responses to the CONNECT method are not cacheable.
zh_cn: 对 CONNECT 方法的响应不可缓存。

source: Responses to the HEAD request method (Section 4.3.2 of [RFC7231]) never include a message body because the associated response header fields (e.g., Transfer-Encoding, Content-Length, etc.), if present, indicate only what their values would have been if the request method had been GET (Section 4.3.1 of [RFC7231]).
zh_cn: 对 HEAD 请求方法的响应（[RFC7231] 的第 4.3.2 节）从不包含消息体，因为相关的响应首部字段（例如，Transfer-Encoding, Content-Length等）（如果存在）仅在请求方法是 GET 时指示它们的值（[RFC7231] 的第 4.3.1 节）。

source: Responses to the OPTIONS method are not cacheable.
zh_cn: 对 OPTIONS 方法的响应不可缓存。

source: Responses to the TRACE method are not cacheable.
zh_cn: 对 TRACE 方法的响应不可缓存。

source: Responses to this method MUST NOT be cached.
zh_cn: 不得缓存对此方法的响应。

source: Responses to this method are not cacheable, unless the response includes appropriate Cache-Control or Expires header fields.
zh_cn: 除非响应包含适当的 Cache-Control 或 Expires 首部字段，否则对此方法的响应不可缓存。

source: Responses to this method are not cacheable.
zh_cn: 对此方法的响应不可缓存。

source: Responses with status codes that are defined as cacheable by default (e.g., 200, 203, 204, 206, 300, 301, 404, 405, 410, 414, and 501 in this specification) can be reused by a cache with heuristic expiration unless otherwise indicated by the method definition or explicit cache controls [RFC7234]; all other status codes are not cacheable by default.
zh_cn: 默认情况下定义为可缓存的状态代码的响应(例如，本规范中的 200,203,204,206,300,301,404,405,410,414 和 501)可以由具有启发式到期的缓存重用，除非否则由方法定义或显式缓存控制 [RFC7234] 指示；默认情况下，所有其他状态代码都不可缓存。

source: Resumption and Pre-Shared Key (PSK)
zh_cn: 恢复和预共享密钥(PSK)

source: Retrying Requests
zh_cn: 重试请求

source: Returned instead of handshake_failure when a negotiation has failed specifically because the server requires ciphers more secure than those supported by the client.
zh_cn: 当协商失败时返回此消息，而不是 handshake_failure，因为服务器要求加密比客户端支持的加密更安全。

source: Right arrows (-->) indicate departure of a TCP segment from TCP A to TCP B, or arrival of a segment at B from A. Left arrows (<--), indicate the reverse.
zh_cn: 右箭头(-->)表示 TCP 报文段从 TCP A 到 TCP B 的离开，或者从 A 到达 B 的报文段的到达。左箭头(<--)表示相反。

source: Risks of Intermediaries
zh_cn: 中介的风险

source: Robustness Principle
zh_cn: 稳健性原则

source: Rules about implicit linear whitespace between certain grammar productions have been removed; now whitespace is only allowed where specifically defined in the ABNF.
zh_cn: 关于某些语法产生之间的隐式线性空白的规则已被删除；现在只允许在 ABNF 中明确定义的空格。

source: Rules for When to Use Entity Tags and Last-Modified Dates.89
zh_cn: 何时使用实体标签和最后修改日期的规则.89

source: RxJava (and its derivatives like RxGroovy & RxScala) has developed an Observable variant called “Single.”
zh_cn: RxJava(及其衍生品，如 RxGroovy 和 RxScala)开发了一种名为“Single”的 Observable 变体。

source: RxJava 2 features several base classes you can discover operators on:
zh_cn: RxJava 2 具有几个可以发现运算符的基类：

source: RxJava 2 features several standard schedulers accessible via `Schedulers` utility class.
zh_cn: RxJava 2 具有几个可通过 `Schedulers` 实用程序类访问的标准调度器。

source: RxJava 2's design was heavily influenced by the [Reactive Streams](https://github.com/reactive-streams/reactive-streams-jvm#reactive-streams) specification, therefore, the library features a class and an interface per each reactive type:
zh_cn: RxJava 2 的设计深受 [Reactive Streams](https://github.com/reactive-streams/reactive-streams-jvm#reactive-streams) 规范的影响，因此，该库为每种反应类型提供了一个类和一个接口：

source: RxJava 2.0 has been completely rewritten from scratch on top of the Reactive-Streams specification.
zh_cn: RxJava 2.0 已经根据 Reactive-Streams 规范从头开始完全重写。

source: RxJava 2.0.0-RC2 introduced a new base reactive type called `Maybe`.
zh_cn: RxJava 2.0.0-RC2 引入了一个名为 `Maybe` 的新的基本响应类型。

source: RxJava 2.x no longer accepts `null` values and the following will yield `NullPointerException` immediately or as a signal to downstream:
zh_cn: RxJava 2.x 不再接受 `null` 值，以下将立即产生 `NullPointerException` 或作为下游的信号：

source: RxJava chose to name such operators by appending the type as suffix as well:
zh_cn: RxJava 选择通过将类型附加为后缀来命名此类运算符：

source: RxJava is a Java VM implementation of [Reactive Extensions](http://reactivex.io): a library for composing asynchronous and event-based programs by using observable sequences.
zh_cn: RxJava 是 [Reactive Extensions](http://reactivex.io) 的 Java VM 实现：其用于通过使用可观察序列来编写异步和基于事件的程序。

source: RxJava is a Java VM implementation of [ReactiveX (Reactive Extensions)](https://reactivex.io): a library for composing asynchronous and event-based programs by using observable sequences.
zh_cn: RxJava 是 [ReactiveX(Reactive Extensions)](https://reactivex.io) 的 Java VM 实现：其通过使用可观察序列来编写异步和基于事件的程序。

source: RxJava is meant for a more polyglot environment than just Java/Scala, and it is being designed to respect the idioms of each JVM-based language.
zh_cn: RxJava 用于比 Java/Scala 更多的多语言环境，它被设计为尊重每种基于 JVM 的语言的习语。

source: RxJava operators don't work with `Thread`s or `ExecutorService`s directly but with so called `Scheduler`s that abstract away sources of concurrency behind a uniform API.
zh_cn: RxJava 运算符不能直接使用 `Thread` 或 `ExecutorService`，而是使用所谓的 `Scheduler` 来抽象统一 API 背后的并发源。

source: RxJava supports Java 6 or higher and JVM-based languages such as [Groovy](https://github.com/ReactiveX/RxGroovy), [Clojure](https://github.com/ReactiveX/RxClojure), [JRuby](https://github.com/ReactiveX/RxJRuby), [Kotlin](https://github.com/ReactiveX/RxKotlin) and [Scala](https://github.com/ReactiveX/RxScala).
zh_cn: RxJava 支持 Java 6 或更高版本以及基于 JVM 的语言，如 [Groovy](https://github.com/ReactiveX/RxGroovy)，[Clojure](https://github.com/ReactiveX/RxClojure)，[JRuby] (https://github.com/ReactiveX/RxJRuby)，[Kotlin](https://github.com/ReactiveX/RxKotlin) 和 [Scala](https://github.com/ReactiveX/RxScala)。

source: RxJava tries to be very lightweight.
zh_cn: RxJava 试图非常轻量级。

source: S1 = ISN(t) -- last used sequence number on old incarnation of connection!
zh_cn: S1 = ISN(t) - 旧的连接化身上最后使用的序列号！

source: SEG.ACK - segment acknowledgment number
zh_cn: SEG.ACK - 报文段确认号

source: SEG.ACK = acknowledgment from the receiving TCP (next sequence number expected by the receiving TCP)
zh_cn: SEG.ACK =来自接收 TCP 的确认号(接收 TCP 预期的下一个序列号)

source: SEG.LEN - segment length
zh_cn: SEG.LEN - 报文段长度

source: SEG.LEN = the number of octets occupied by the data in the segment (counting SYN and FIN)
zh_cn: SEG.LEN =报文段中数据占用的八位字节数(计算 SYN 和 FIN)

source: SEG.PRC - segment precedence value
zh_cn: SEG.PRC - 报文段优先值

source: SEG.SEQ - segment sequence number
zh_cn: SEG.SEQ - 报文段序列号

source: SEG.SEQ = first sequence number occupied by the incoming segment
zh_cn: SEG.SEQ =传入报文段占用的第一个序列号

source: SEG.SEQ = first sequence number of a segment
zh_cn: SEG.SEQ =报文段的第一个序列号

source: SEG.SEQ+SEG.LEN-1 = last sequence number occupied by the incoming segment
zh_cn: SEG.SEQ+SEG.LEN-1 =传入报文段占用的最后一个序列号

source: SEG.SEQ+SEG.LEN-1 = last sequence number of a segment
zh_cn: SEG.SEQ+SEG.LEN-1 = 报文段的最后序列号

source: SEG.UP - segment urgent pointer
zh_cn: SEG.UP - 报文段紧急指针

source: SEG.WND - segment window
zh_cn: SEG.AND - 报文段窗口
